---
kind: type
id: T:Autodesk.Revit.DB.BRepBuilderPersistentIds
source: html/c9dd5c21-1d35-9f12-ec28-553e699a6ee2.htm
---
# Autodesk.Revit.DB.BRepBuilderPersistentIds

This class stores a map from ExternalGeometryIds to BRepBuilderGeometryIds.

## Syntax (C#)
```csharp
public class BRepBuilderPersistentIds : IDisposable
```